# IsPolyClosed

## Description
Returns true if the specified polyline or polygon is a closed shape, and false otherwise.

```pascal
FUNCTION IsPolyClosed(polyHandle : HANDLE) : BOOLEAN;
```

```python

def vs.IsPolyClosed(polyHandle):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|polyHandle|HANDLE||

## Version
Availability: from Vectorworks 2014
## Category
* Objects - Polys